# -*- coding: utf-8 -*-
import pandas as pd

root_path = r"D:/synchronize folder/OneDrive - my.swjtu.edu.cn/文件/学业发展中心/源数据/"
folder_and_file = [
    r"04 其他/",
    [r"茅院(信息)2014-01班", r"通信2015-03班[国]",
     r"通信2016-03班[国]", r"智能(茅班)2019-01班"],

    r"15 计算机2014~2018/",
    [r"计算机2014-01班", r"计算机2014-02班", r"计算机2014-03班", r"计算机2014-04班",
     r"计算机2015-01班", r"计算机2015-02班", r"计算机2015-03班",
     r"计算机2016-01班", r"计算机2016-02班",
     r"计算机2017-01班", r"计算机2017-02班", r"计算机2017-03班",
     r"计算机2018-01班", r"计算机2018-02班", r"计算机2018-03班"],

    r"07 物联网2014~2017/",
    [r"物联网2014-01班", r"物联网2014-02班",
     r"物联网2015-01班", r"物联网2015-02班",
     r"物联网2016-01班", r"物联网2016-02班",
     r"物联网2017-01班"],

    r"18 轨道2014~2019/",
    [r"轨道2014-01班", r"轨道2014-02班", r"轨道2014-03班",
     r"轨道2015-01班", r"轨道2015-02班", r"轨道2015-03班",
     r"轨道2016-01班", r"轨道2016-02班", r"轨道2016-03班",
     r"轨道2017-01班", r"轨道2017-02班", r"轨道2017-03班",
     r"轨道2018-01班", r"轨道2018-02班", r"轨道2018-03班",
     r"轨道2019-01班", r"轨道2019-02班", r"轨道2019-03班",]]
file_format = r".csv"

xls = pd.read_csv(
    r"D:/synchronize folder/OneDrive - my.swjtu.edu.cn/文件/学业发展中心/源数据/04 其他/智能(茅班)2019-01班.csv")
print(xls)
